<?php
require_once("head.html")
?>
<div class="main-content">
   <div class="row large-12 columns large-centered">
        <p style="font-size:32px">Human Practice</p>
        
      </div>
     <div class="row large-12 columns large-centered">
       <h4>Management</h4>
      <div class="underline-small">
        
      </div>
        <p>A Story with Software and iGEM
2014年4月1日，愚人节，在这样一个什么都不能太当真的日子里，我们的队伍——
USTC_Software却非常正式的成立了，一段美妙的旅程。
任何旅程，如果想要到达远方的地平线，就需要可靠的交通工具，而在这段旅程中，我们也有
幸获得了许多“工具”的帮助，许多功能强大有便于操作的软件的帮助。如今，我们在这里分享
出我们的经历，同时我们也希望把这些“工具”介绍给接下来将要踏上行程的人们，让它们给你
们更多的帮助
NO.1 队伍的建立与磨合 软件队刚刚建立之时，队员都是来自不同专业的同学们，互相都很陌
生。而想要使得队伍可以良好的运作下去，就必须进行足够多的交流并且达成使得每个人都比
较满意的合作模式。尽管每个队员都对IGEM项目有着极大的热情，他们仍然有自己的学业等
个人问题需要担心，与此同时，队员也分布在学校的不同地理位置上。故而，在无法保证团队
集中工作时间的情况下，如何使得队员们方便的交流成了项目快速推进的重要问题。Google
group极好的解决了这个问题。 Google group向用户提供开放的网络平台，使得用户可以建立
自己的共享平台，平台上的会话对一切加入了该group的用户可见，并可以设定邮件的推送功
能。我们在Google group提供的网络平台上建立了属于我们软件队自己的平台，所有发布在平
台上的回话都会被及时的推送到队员们的个人邮箱中。借助Google group，我们得以： 1 及时
的向所有队员发布通知和工作安排； 2 让队员们之间便利的共享各自的想法，创意； 3 通过共
享工作日志保证团队各种规章，考评，财务的透明化； 在此，我们根据自己的使用经历推荐在
项目管理中使用Google group，它可以使你突破时间，地理的限制，可以使得团队交流更深入
一个层次，也可以使得团队工作透明化。最重要的是，它帮助一支队伍快速的从分立走向合
作，使得团队可以作为一个整体良性的开展工作。
NO.2 工作安排 好啦，队伍建立了，队员之间也熟悉了，大家在一起都很开心，但是总得有人
来操心那些不那么令人愉快的工作，不是吗？所以带给我们另一个问题，如何方便的分配工作
并监督工作进度呢？ 也许看过上文，你已经用上了Google group。嘿，Google group好像是
个不错的选择。Sorry，Google group的会话共享功能对于队员间交流和团队公示非常方便，
但当项目不断深入，工作变得越来越繁琐时，它就显得相当不方便，此时我们使用了另一个功
能强大的软件——wunderlist。 Wunderlist是一款专门的工作安排规划软件。负责人可以在平
台上创建属于自己那部分工作的list，并邀请他需要的用户来帮助他完成这些工作。在这个过程
中，负责人可以设定不同工作的指定队员，限定deadline。而队员在完成了相关的工作之后也
可以反馈到list中，这样负责人就可以把工作从list中删除。Wunderlist的另一个优势是它可以在各个平台上使用，pc，手机等等。这样可以确保各队员最及时的收到工作通知。 在我们的项
目中，我们根据队伍的工作，创建了IGEM-backend，IGEM-frontend，IGEM-wiki，IGEM-
finance等list，把纷繁的工作纳入了不同的负责人的管理下，做到了专人专用。同时，我们又
利用wunderlist的反馈功能即时的监视工作进度。正是wunderlist的使用，既使得我们可以合理
的分派管理工作，又可以使得每个人对工作进度有实时的感官，从而保证everything is
according to plan。
NO.3 团队经费 好了，数不清的工作终于安排完毕了，再没什么麻烦了吧？No，还有大麻烦等
着呢。没错，那就是队伍经费问题啦。 对于任何队伍来说，经费的管理都是个大问题。当然，
或许你会很自然的采取钱帐分开这种策略。但是，你如何保持两名甚至更多的财务管理员间的
同步呢？我们使用OneNote来解决这个问题。 OneNote原本用于快速创建和共享笔记。但由于
他可以快速创建不同的笔记本和强大的共享功能使得OneNote可以很好的适用于账目管理。我
们可以针对不同的条目创建相关笔记本，并在笔记本中标出已清或未清的账目。通过邀请他
人，使得队长可以定期监督经理的账目状况，确保财务准确无误。
NO.4 管理你的思维 那么，繁琐的日常工作搞定，我们终于可以开始我们的项目了。等等，我
们应该做什么项目呢？我们应该怎么做？我们应该。。。。。。 好啦，你需要点子。耐心点，
你会在接下来的工作中不断地遇到这种情况。并且相信我，不管在什么项目的什么时间段，每
当你需要新想法时，如何得到满意的结果总是令人痛苦的。头脑风暴或许不错，但你更有可能
的是对着满满一白板杂乱的点子干瞪眼。为了解决这个问题，你需要一类软件来辅助你，它们
就是思维辅助类软件，比如omni outliner和mindmap Omni outliner类软件可以在你写文章时帮
助你组织大纲，理清思路。非常有助于快速组织文字。 而mindmap类软件则帮助你简洁的画
出思维导图来帮助你理清思维，总结观点，从而使得你可以从头脑风暴后众多纷繁的观点出迅
速的总结出精彩的想法。
NO.5 Coding 和版本管理 NO.6 文件共享 好了，目前为止，你总算做出了部分成果。可喜可
贺，不过这有带给我们一个问题。 在项目进行的过程中，总会不断地产生各种各样的文件，需
要大家阅览的论文、需要展示的工作日志、写好的程序、必备资料、甚至于平日的照片之类
的。你会怎样存储这些文件呢，都存在某人的电脑上吗？那样会不会太占据他的内存了呢。又
或者当其他人需要这些文件时怎么办呢，不厌其烦的联系该人向他讨要吗？不，那样未免过于
麻烦了，我们有更好的解决办法——dropbox Dropbox是一种云存储软件。它允许用户将文件
存储在网络云端。这样，任何队伍中的人只要知晓了云端账户的密码就可以随时随地获取团队
的共享文件了。当然同时，将文件存储在云端也是一种极安全的存储方式，以防你万一把咖啡
泼在了电脑或稿纸上。</p>

        <h4>Biology Cooperation</h4>
      <div class="underline-small">
        
      </div>
        <p>
- Background（⽣物学家的交流⽅式，研究领域分⽴，影响）<br />
- 软件合作功能描述（配图，配案例）<br />
- 展望<br />
- 意义（增进联系，类⽐wikipedia，成果分享）<br />
- ⽤户的使⽤体验<br /></p>

        <h4> iGEM Meetup</h4>
      <div class="underline-small">
        
      </div>
        <p>
 - 组委会提供的Meetup说明<br />
- 活动过程记录、在校学⽣旁听<br />
- 成果、合⼯⼤<br />
- 各队反馈<br />
        </p>
  </div>
</div>
<?php

require_once("foot.html")
?>
